Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཟོད་པའི་མཐུ་ལ་གནས་པ་དང་། རབ་ཏུ་དགའ་ཞིང་སྤྲོ་བ་མྱོང་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་མངོན་དུ་བྱ་བ་དང་། བླ་མ་ལ་བསྙེན་བཀུར་ཞིང་དད་པས་གུས་པར་བྱ་བ་དང་།
en: If you ask what these eight are, they comprise (1) purity of ethical discipline, (2) gratitude and thankfulness, (3) being grounded in the power of tolerance, (4) experiencing delight and joy, (5) not forsaking any being, (6) actualizing great compassion, (7) respect for and veneration of the spiritual teacher by means of faith, and (8) perseverance in and searching for the perfections.

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་ཞིང་ཚོལ་བ་སྟེ། རབ་འབྱོར་ཆོས་བརྒྱད་པོ་དེ་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་གཉིས་པ་ལ་གནས་པས། ཡང་དང་ཡང་ཡིད་ལ་བྱ་ཞིང་། དེ་དག་ལ་ནན་ཏན་དུ་བྱ་བ་དག་གོ །
en: Subhūti, these are the eight attributes to which bodhisattva great beings who dwell on the second level should pay attention and which they should earnestly apply. “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ས་གསུམ་པ་ལ་གནས་པས། ཆོས་ལྔ་ལ་གནས་པར་བྱ་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མང་དུ་ཐོས་པས་མི་ངོམས་ཤིང་།
en: Moreover, Subhūti, bodhisattva great beings who dwell on the third level should maintain five attributes.

source: དེ་ལ་ཡང་ཡི་གེ་ལ་མངོན་པར་མ་ཞེན་པ་དང་། ཟང་ཟིང་མེད་པར་ཆོས་ཀྱི་སྦྱིན་པ་རྣམ་པར་འབྱེད་ཅིང་། དེས་ཀྱང་རློམ་སེམས་སུ་མི་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་ཡོངས་སུ་བསྔོ་ཡང་། དེས་རློམ་སེམས་སུ་མི་འགྱུར་བ་དང་། དཔག་ཏུ་མེད་པའི་འཁོར་བས་ཡོངས་སུ་སྐྱོ་བ་མེད་ཅིང་། དེས་ཀྱང་རློམ་སེམས་སུ་མི་འགྱུར་བ་དང་། ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ལ་གནས་ཀྱང་།
en: If you ask what these five are, they comprise (1) an insatiable thirst for erudition but without fixation on letters; (2) elucidating without expectations the gift of the Dharma, but without making assumptions with respect to it; (3) generation and dedication of the roots of virtuous actions for the refinement of the buddhafields but without making assumptions in that respect; (4) indefatigability in the face of the fathomless cycle of rebirth but without making assumptions in that respect; and (5) maintaining of a sense of conscience and shame but without making assumptions in that respect.

source: དེས་རློམ་སེམས་སུ་མི་འགྱུར་བ་སྟེ། རབ་འབྱོར་ཆོས་ལྔ་པོ་དེ་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་གསུམ་པ་ལ་གནས་པར་བྱ་བ་དག་གོ །
en: Subhūti, these are the five attributes which bodhisattva great beings who dwell on the third level should maintain. “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བཞི་པ་ལ་གནས་པས། ཆོས་བཅུ་པོ་འདི་དག་ཡོངས་སུ་བླངས་ཤིང་གནས་པར་བྱ་སྟེ། དེ་དག་ཡོངས་སུ་བཏང་བར་མི་བྱའོ། །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགོན་པ་ལ་གནས་པ་དང་། འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་།
en: Moreover, Subhūti, bodhisattva great beings who dwell on the fourth level should adopt and maintain ten attributes, without forsaking them.

source: སྦྱངས་པའི་ཡོན་ཏན་གྱི་སྡོམ་པ་མི་བཏང་བ་དང་། བསླབ་པ་ཡོངས་སུ་མི་བཏང་བ་དང་། འདོད་པའི་ཡོན་ཏན་ལ་སྨད་པ་དང་། མྱ་ངན་ལས་འདའ་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་དང་། རྫས་ཐམས་ཅད་ཡོངས་སུ་བཏང་བ་དང་། སེམས་ཞུམ་པ་མེད་པ་དང་།
en: If you ask what these ten are, they comprise (1) dwelling in a forest wilderness, (2) paucity of desires, (3) contentment, (4) not forsaking vows associated with the ascetic virtues, (5) not forsaking the [monastic] trainings, (6) spurning the desirable attributes of the senses (7) setting the mind on the transcendence of sorrow, (8) forsaking all substantial phenomena, (9) undauntedness, and (10) disregard for all entities.

source: དངོས་པོ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པ་སྟེ། རབ་འབྱོར་ཆོས་བཅུ་པོ་དེ་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བཞི་པ་ལ་གནས་པས། ཡོངས་སུ་གཏང་བར་མི་བྱ་ཞིང་། ཡང་དག་པར་བླངས་ཏེ་གནས་པར་བྱ་བ་དག་གོ །
en: Subhūti, these are the ten attributes that bodhisattva great beings who dwell on the fourth level should not forsake, but adopt and maintain. “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་ལྔ་པ་ལ་གནས་པས། ཆོས་དྲུག་པོ་འདི་དག་ཡོངས་སུ་སྤང་བར་བྱ་སྟེ།
en: Moreover, Subhūti, bodhisattva great beings who dwell on the fifth level should avoid six attributes.

source: དྲུག་གང་ཞེ་ན། འདི་ལྟར་ཁྱིམ་པ་དང་བསྟེན་པ་ཡོངས་སུ་སྤང་བར་བྱ་བ་དང་། དགེ་སློང་མ་དང་བསྟེན་པ་དང་། རིགས་ལ་སེར་སྣ་བྱེད་པ་དང་། འདུ་འཛིའི་གནས་དང་།
en: If you ask what these six are, they comprise (1) the avoidance of intimacy with householders, (2) [the avoidance of] intimacy with nuns, (3) [the avoidance of] jealousy toward those of the spiritual family, (4) [the avoidance] of places of social intercourse, (5) [the avoidance of] malice, and (6) [the avoidance of] self-praise and disparagement of others.

source: གནོད་སེམས་དང་། བདག་བསྟོད་ཅིང་གཞན་སྨོད་པ་སྟེ། ཆོས་དྲུག་པོ་དེ་དག་ནི་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: These are the six attributes to be avoided.

source: །ཡང་ཆོས་བརྒྱད་ཡོངས་སུ་སྤང་བར་བྱ་སྟེ།
en: There are eight further attributes to be avoided.

source: འདི་ལྟར་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡོངས་སུ་སྤང་བར་བྱའོ། །ལྷག་པའི་ང་རྒྱལ་དང་ཁེངས་པ་དང་། ཕྱིན་ཅི་ལོག་རྣམས་དང་། ཐོ་ཙམ་དང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཉམ་རང་སུ་གཞག་པ་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: These comprise (1) the avoidance of the paths of the ten nonvirtuous actions, (2) [the avoidance of] exalted pride, (3) [the avoidance of] boasting, (4) [the avoidance of] distorted views, (5) [the avoidance of] doubt, and (6–8) the tolerance of desire, hatred, and delusion.

source: །ཆོས་བརྒྱད་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་ལྔ་པ་ལ་གནས་པས་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: These are the eight further attributes that bodhisattva great beings who dwell on the fifth level should avoid. {

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དྲུག་པ་ལ་གནས་པས། ཆོས་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ། འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གོ །
en: Dt.216} “Moreover, Subhūti, bodhisattva great beings who dwell on the sixth level should perfect six things; those are the six perfections.

source: གཞན་ཡང་ཆོས་དྲུག་ཡོངས་སུ་སྤང་བར་བྱ་སྟེ།
en: They should, moreover, avoid six things.

source: དྲུག་གང་ཞེ་ན།
en: You may ask what these six are. (

source: ཉན་ཐོས་ཀྱི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ། །རང་སངས་རྒྱས་ཀྱི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ། །སྲེད་པའི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ། །སློང་མོ་པ་མཐོང་ན་ཞུམ་པ་མེད་པར་བྱ་སྟེ། ཞུམ་པའི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ། །དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་ཡིད་མི་བདེ་བར་མི་བྱ་སྟེ།
en: 1) The mindset of the śrāvakas should be avoided; (2) the mindset of the pratyekabuddhas should be avoided; (3) thoughts of anxiety should be avoided; (4) one should be undaunted when one sees beggars—that is to say, discouragement should be avoided; (5) unhappiness—that is to say, unhappiness on account of having renounced all material things—should be avoided; and (6) when one sees beggars one should not be disturbed by the beggars—that is to say, the disturbance should be avoided.

source: ཡིད་མི་བདེ་བ་ཡོངས་སུ་སྤང་བར་བྱའོ། །སློངས་མོ་པ་མཐོང་ན་སློངས་མོ་པས་འཁྲུག་པར་མི་བྱ་སྟེ། འཁྲུག་པའི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ། །རབ་འབྱོར་ཆོས་དྲུག་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དྲུག་པ་ལ་གནས་པས་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: Subhūti, these are the six things that bodhisattva great beings who dwell on the sixth level should avoid. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བདུན་པ་ལ་གནས་པས་ཆོས་ཉི་ཤུ་མི་བྱ་སྟེ། ཉི་ཤུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་ཏུ་འཛིན་པར་མི་བྱའོ། །སེམས་ཅན་དུ་འཛིན་པ་དང་། སྲོག་ཏུ་འཛིན་པ་དང་། གང་ཟག་ཏུ་འཛིན་པ་དང་། ཆད་པར་འཛིན་པ་དང་། རྟག་པར་འཛིན་པ་དང་། མཚན་མའི་འདུ་ཤེས་དང་། རྒྱུར་ལྟ་བ་དང་། མིང་དང་གཟུགས་ལ་མངོན་པར་ཆགས་པ་དང་། ཕུང་པོ་ལ་མངོན་པར་ཆགས་པ་དང་། ཁམས་ལ་མངོན་པར་ཆགས་པ་དང་། སྐྱེ་མཆེད་ལ་མངོན་པར་ཆགས་པ་དང་། ཁམས་གསུམ་ལ་མངོན་པར་ཆགས་པ་དང་། ཁམས་གསུམ་ལ་མངོན་པར་ཞེན་པ་དང་། ཁམས་གསུམ་ལ་རྟེན་པ་དང་། ཁམས་གསུམ་ལ་གནས་པ་དང་། སངས་རྒྱས་ལ་རྟེན་པའི་ལྟ་བ་ལ་མངོན་པར་ཆགས་པ་དང་།
en: Moreover, Subhūti, bodhisattva great beings who dwell on the seventh level should not engage in twenty things.

source: ཆོས་ལ་རྟེན་པའི་ལྟ་བ་ལ་མངོན་པར་ཆགས་པ་དང་། དགེ་འདུན་ལ་རྟེན་པའི་ལྟ་བ་ལ་མངོན་པར་ཆགས་པ་དང་། ཚུལ་ཁྲིམས་ལ་རྟེན་པའི་ལྟ་བ་ལ་མངོན་པར་ཆགས་པ་དང་། ཆོས་རྣམས་སྟོང་ངོ་ཞེས་ཞུམ་པར་འགྱུར་བ་དང་། སྟོང་པ་ཉིད་དང་འགལ་བ་སྟེ།
en: If you ask what these twenty are, they should not engage in (1) grasping notions of self; (2) grasping notions of beings; (3) grasping notions of living creatures; (4) grasping notions of individual persons; (5) grasping notions of nihilism; (6) grasping notions of eternalism; (7) notions of signs; (8) holding views about causes; (9) attachment to name and form; (10) attachment to the psycho-physical aggregates, along with attachment to the sensory elements, and attachment to the sense fields; (11) attachment to the three realms; (12) fixation on the three realms; (13) reliance on the three realms; (14) abiding in the three realms; (15) attachment to views of dependency on the buddhas; (16) attachment to views of dependency on the Dharma; (17) attachment to views of dependency on the saṅgha; (18) attachment to views of dependency on ethical discipline; (19) discouragement due to the fact that phenomena are empty; or (20) contradiction of emptiness.

source: རབ་འབྱོར་ཆོས་ཉི་ཤུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བདུན་པ་ལ་གནས་པས་མི་བྱའོ་དེས་ཆོས་ཉི་ཤུ་པོ་འདི་དག་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ། ཉི་ཤུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་སྟོང་པ་ཉིད་རྫོགས་པར་བྱ་བ་དང་། མཚན་མ་མེད་པ་མངོན་དུ་བྱ་བ་དང་། སྨོན་པ་མེད་པ་ཤེས་པར་བྱ་བ་དང་། འཁོར་གསུམ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཞིང་སྙིང་བརྩེ་བ་དང་། སེམས་ཅན་དེ་དག་ལ་བརྙས་པར་མི་བྱ་བ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ལྟ་བ་ཡང་དག་པའི་ཚུལ་རབ་ཏུ་རྟོགས་ཤིང་། དེས་རློམ་སེམས་སུ་མི་བྱ་བ་དང་། མི་སྐྱེ་བ་ལ་བཟོད་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་དང་།
en: Subhūti, these are the twenty things in which bodhisattva great beings who dwell on the seventh level should not engage.

source: ཆོས་ཐམས་ཅད་ཚུལ་གཅིག་ཏུ་བསྟན་པ་དང་། རྟོག་པ་ཡང་དག་པར་བསལ་བ་དང་། ལྟ་བ་རྣམ་པར་ཟློག་པ་དང་། ཉོན་མོངས་པ་རྣམ་པར་ཟློག་པ་དང་།
en: There are also twenty things that they should perfect.

source: ཞི་གནས་དང་ལྷག་མཐོང་གིས་དང་། དུལ་བའི་སེམས་དང་། ཞི་བའི་སེམས་དང་། ཐོགས་པ་མེད་པ་དང་། བྱམས་པའི་སྐབས་ཤེས་པ་དང་།
en: If you ask what these twenty are, they comprise (1) the perfection of emptiness; (2) the actualizing of signlessness; (3) understanding of wishlessness; (4) purity of the threefold interaction [of giver, giving, and recipient]; (5) compassion and pity for all beings; (6) absence of contempt for those beings; (7) the view of the sameness of all phenomena without making assumptions about it; (8) understanding of authenticity without making assumptions about it; (9) acceptance of the nonarising nature of phenomena; (10) understanding of nonarising; (11) the demonstration that all phenomena are of a single principle; (12) the actual elimination of ideation; (13) the reversal of views, (14) the reversal of afflicted mental states; (15) the level of stillness and higher insight; (16) a disciplined mind; (17) a peaceful mind; (18) unimpededness; (19) understanding of the circumstances of loving kindness; and (20) frequenting of the buddhafields at will.

source: གང་དུ་འདོད་པའི་ཞིང་དུ་འགྲོ་བ་སྟེ། རབ་འབྱོར་ཆོས་ཉི་ཤུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བདུན་པ་ལ་གནས་པས་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Subhūti, these are the twenty things that bodhisattva great beings who dwell on the seventh level should perfect. {

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ས་བརྒྱད་པ་ལ་གནས་པས། ཆོས་བཞི་པོ་འདི་དག་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: Dt.217} “Moreover, Subhūti, bodhisattva great beings who dwell on the eighth level should perfect four attributes.

source: བཞི་གང་ཞེ་ན། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བལྟ་ཞིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཇི་ལྟར་མཐོང་བ་དེ་དག་ཡོངས་སུ་བསྒྲུབ་པ་དང་།
en: If you ask what these four are, they should have (1) comprehension of the minds of all beings; (2) playful emanation through extrasensory powers; (3) vision of the buddhafields and the actualizing of these buddhafields just as one has seen them; and (4) veneration of the buddhas and definitive inspection of the buddha body, just as it is.

source: སངས་རྒྱས་བསྙེན་བཀུར་ཞིང་། སངས་རྒྱས་ཀྱི་སྐུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟག་པ་སྟེ། རབ་འབྱོར་ཆོས་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བརྒྱད་པ་ལ་གནས་པས་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Subhūti, these are the four attributes that bodhisattva great beings who dwell on the eighth level should perfect. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བརྒྱད་པ་ལ་གནས་པས་ཆོས་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དབང་པོ་རབ་དང་།
en: Moreover, Subhūti, there are four further attributes that bodhisattva great beings who dwell on the eighth level should perfect.

source: ཐ་མ་ཤེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བ་དང་། སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་ཡང་དང་ཡང་མཉམ་པར་གཞག་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཇི་ལྟ་ཇི་ལྟར་འགྲུབ་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ལུས་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར།
en: If you ask what these four are, they comprise (1) recognition of those of higher and lower acumen, (2) refinement of the buddhafields, (3) continuous absorption in illusion-like meditative stability, and (4) purposeful consideration and taking of rebirth in order to assume a body commensurate with the roots of the virtuous actions of beings.

source: ཆེད་དུ་བསམས་ཤིང་སྲིད་པ་ཉེ་བར་ལེན་པ་སྟེ། རབ་འབྱོར་ཆོས་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བརྒྱད་པ་ལ་གནས་པས་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Subhūti, these are the four [further] attributes that bodhisattva great beings who dwell on the eighth level should perfect. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དགུ་པ་ལ་གནས་པས། ཆོས་བཅུ་གཉིས་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ། བཅུ་གཉིས་གང་ཞེ་ན། འདི་ལྟར་སྨོན་ལམ་མཐའ་ཡས་པ་ཡོངས་སུ་བཟུང་སྟེ།
en: Moreover, Subhūti, bodhisattva great beings who dwell on the ninth level should perfect twelve attributes.

source: ཇི་ལྟ་ཇི་ལྟར་སྨོན་པ་དེ་ལྟ་དེ་ལྟར་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་སྐད་ཤེས་པ་དང་། ཡོངས་སུ་རྫོགས་པའི་སྤོབས་པས་ངེས་པར་བསྟན་པ་ཤེས་པ་དང་། མའི་མངལ་དུ་འགྲོ་བ་ཕུན་སུམ་ཚོགས་པ་དང་། རིགས་ཕུན་སུམ་ཚོགས་པ་དང་། རྒྱུད་ཕུན་སུམ་ཚོགས་པ་དང་། རུས་ཕུན་སུམ་ཚོགས་པ་དང་། འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་།
en: If you ask what these twelve are, they comprise (1) the acquisition of infinite aspirations, excellently accomplishing whatever aspirations are made; (2) knowledge of the languages of the gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas; (3) knowledge of expositions based on perfect inspired speech; (4) excellence of the entry into the mother’s womb; (5) excellence of family; (6) excellence of class; (7) excellence of clan; (8) excellence of entourage; (9) excellence of birth; (10) excellence of departure from home; (11) excellence of the ornaments of the tree of enlightenment; and (12) excellence of all enlightened attributes.

source: ཚེ་ཕུན་སུམ་ཚོགས་པ་དང་། མངོན་པར་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཤིང་གི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་དང་། ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་སྟེ། རབ་འབྱོར་ཆོས་བཅུ་གཉིས་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དགུ་པ་ལ་གནས་པས་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Subhūti, these are the twelve attributes that bodhisattva great beings who dwell on the ninth level should perfect. “

source: །རབ་འབྱོར་ས་བཅུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་བརྗོད་དོ།
en: Moreover, Subhūti, bodhisattva great beings who dwell on the tenth level are indeed said to be tathāgatas.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དང་པོ་ལ་གནས་པའི་ལྷག་པའི་བསམ་པ་ལ་སྩོགས་པ་ཡོངས་སུ་སྦྱང་བ་གང་ལགས།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, what, for bodhisattva great beings who dwell on the first level, is the refinement of sincere resolve and so forth?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དགེ་བའི་རྩ་བ་མང་པོ་ཡོངས་སུ་དག་པར་སྡུད་པ་འདི་ནི།
en: Subhūti,” replied the Lord [Buddha], “bodhisattva great beings correctly gather many roots of virtuous action by developing the mind set on all-aspect omniscience.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of sincere resolve. [If you ask what, for bodhisattva great beings, is the refinement of beneficial states, it is the search for the knowledge of the Great Vehicle for the sake of all beings. For bodhisattva great beings, this is the refinement of beneficial states].

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། ཚད་མེད་པ་བཞི་པོ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་།
en: If you ask what, for bodhisattva great beings, is the refinement of equanimity with regard to all beings, it is the actualization of the four immeasurable attitudes—loving kindness, compassion, empathetic joy, and equanimity—by developing the mind set on all-aspect omniscience.

source: བཏང་སྙོམས་མངོན་པར་བསྒྲུབ་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of equanimity with regard to all beings. {

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གཏོང་བ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་རྟོག་པ་མེད་པར་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་སྟེ།
en: Dt.218} If you ask what, for bodhisattva great beings, is the refinement of renunciation, it is the undertaking of acts of generosity for all beings without discrimination.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གཏོང་བ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of renunciation.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་བསྟེན་པ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གང་དེ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་བསྐུལ་བ་དང་། གཞོག་པ་དང་། རབ་ཏུ་གཞོག་པར་བྱེད་པ་དེ་དག་ནི།
en: If you ask what, for bodhisattva great beings, is the refinement of the service of spiritual mentors for bodhisattva great beings, it is that the spiritual mentors of bodhisattva great beings are those who genuinely encourage, establish, and secure them in all-aspect omniscience, and it is those spiritual mentors whom they should serve, respect, honor, and worship.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ཏེ། དགེ་བའི་བཤེས་གཉེན་དེ་དག་ལ་བསྟེན་པ་དང་། རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་བསྟེན་པ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of the service of spiritual mentors.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་བཙལ་བ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་ཆོས་ཚོལ་ཞིང་། ཉན་ཐོས་ཀྱིས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་བ་འདི་ནི།
en: If you ask what, for bodhisattva great beings, is the refinement of the search for the Dharma, it is that by developing the mind associated with all-aspect omniscience, they search for the Dharma and do not fall to the level of the śrāvakas or the level of the pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་བཙལ་བ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of the search for the Dharma.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡང་དང་ཡང་འབྱུང་བ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། ཚེ་རབས་ཐམས་ཅད་དུ་འདུ་འཛི་མེད་པར་འབྱུང་ཞིང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་ཡང་། དེ་ལ་བར་ཆད་བྱེད་པ་གང་ཡང་མེད་པ་འདི་ནི།
en: If you ask what, for bodhisattva great beings, is the refinement of the continual departure from home, it is that throughout all their lives they have been and are without social diversions, they have become mendicants in the teaching of the tathāgatas, and indeed there is nothing at all that impedes them.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡང་དང་ཡང་འབྱུང་བ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of the continual departure from home.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་སྐུ་ལ་མོས་པ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། སངས་རྒྱས་ཀྱི་སྐུ་མཐོང་ནས། ནམ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མ་གྱུར་གྱི་བར་དུ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the refinement of the wish for the body of a buddha, it is that, having seen the body of a buddha, they will never part from focusing their attention on buddhahood until they attain all-aspect omniscience.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་སྐུ་ལ་མོས་པ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of the wish for the body of a buddha.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་རྣམ་པར་དབྱེ་བ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དེ་བཞིན་གཤེགས་པ་མངོན་དུ་གྱུར་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཚེ། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཅིང་། ཐོག་མར་ཡང་དགེ །བར་དུ་ཡང་དགེ །ཐ་མར་ཡང་དགེ །ཡི་གེ་བཟང་པོ། དོན་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། ཚངས་པའི་སྤྱོད་པ་འདི་ལྟ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the refinement of the disclosure of the Dharma, it is that whether the tathāgatas are present or they have passed into nirvāṇa, they [the bodhisattvas] teach the Dharma to beings, and that [their doctrine] is excellent because it is virtuous in the beginning, virtuous in the middle, and virtuous at the end, and it is excellent in meaning, unadulterated, complete, pure, refined, and chaste.

source: མདོ་དང་དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། འདི་ལྟར་འདས་པ་དང་། སྐྱེས་པའི་རབས་དང་།
en: That is to say, they correctly teach the discourses, the sayings in prose and verse, the prophetic declarations, the verses, the aphorisms, the contexts, the quotations, the tales of past lives, the most extensive teachings, the marvelous events, the narratives, and the established instructions.

source: ཤིན་དུ་རྒྱས་པ་དང་། རྨད་དུ་བྱུང་བ་དང་། རྟོགས་པ་བརྗོད་པ་དང་། གཏན་ལ་ཕབ་པར་བསྟན་པ་དག་ཡང་དག་པར་སྟོན་པ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་རྣམ་པར་དབྱེ་བ་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of the disclosure of the Dharma.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ང་རྒྱལ་དང་། ཁེངས་པ་བསལ་བ་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། ང་རྒྱལ་དང་ཁེངས་པ་ཇི་ལྟར་བསལ་བ་དེས། ནམ་ཡང་རིགས་དམའ་བར་མི་སྐྱེ་བ་འདི་ནི།
en: If you ask what, for bodhisattva great beings, is the refinement of the elimination of pride and arrogance, it is that, on account of their elimination of pride and arrogance, they are never born in an inferior family.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ང་རྒྱལ་དང་ཁེངས་པ་བསལ་བ་ཡོངས་སུ་སྦྱང་བའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཅྭོ་བརྒྱད་པ།
en: For bodhisattva great beings, this is the refinement of the elimination of pride and arrogance.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདེན་པའི་ཚིག་ཡོངས་སུ་སྦྱང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཇི་སྐད་དུ་སྨྲས་པ་དེ་ལྟར་བྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the refinement of words of truth, it is that they do as they say.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདེན་པའི་ཚིག་ཡོངས་སུ་སྦྱང་བའོ།
en: For bodhisattva great beings, this is the refinement of words of truth.

source: །རབ་འབྱོར་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དང་པོ་ལ་གནས་པའི་ཡོངས་སུ་སྦྱང་བ་བཅུའོ།
en: Subhūti, these are the ten refinements of bodhisattva great beings who dwell on the first level. “

source: །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་ཡིད་ལ་མི་བྱེད་ཅིང་།
en: Subhūti, If you ask what, for bodhisattva great beings, is the purity of ethical discipline, it is that they do not pay attention to the mindsets of the śrāvakas or pratyekabuddhas, and, apart from that, they do not pay attention to other codes that would lead to immorality and impede the way to enlightenment.
